--Вставка записей в таблицу Тип автобуса
INSERT INTO busType(nameType)
VALUES
	('микроавтобус'),
	('городской'),
	('низкопольный'),
	('с гармошкой'),
	('междугородний'),
	('комфортабельный'),
	('несуществующий');


--Вставка записей в таблицу Автобусы
INSERT INTO bus("type", model, regNumber, passengerCapacity, price)
VALUES
	(1, 'Газель', 'а001аа', 20, 1000000.00),
	(2, 'ЛиАЗ', 'в002аа', 50, 1500000.50),
	(4, 'Икарус', 'м055ма', 200, 3000000.00),
	(1, 'ПАЗ', 'Е404ок', 25, 1003000.00),
	(5, 'ЛАЗ', 'р041ар', 100, 2350000.80),
	(5, 'SCANIA', 'с330ос', 75, 5000000.00),
	(2, 'Мерседес', 'у658тп', 120, 1000000.00),
	(6, 'ЛиАЗ', 'в666ий', 66, 666666.66),
	(3, 'Камаз', 'р985ав', 140, 4000000.00),
	(7, 'FANTASTIC', 'о000оо', 10000000, 'Infinity');


--Вставка записей в таблицу Автобусные остановки
INSERT INTO busStop(nameStop)
VALUES
	('Аэропорт'),
	('ул.Парковая'),
	('Фабрика мягких игрушек им.Мишутки Поролонова'),
	('Ж/д вокзал'),
	('Центральная'),
	('Больничная'),
	('Заводская'),
	('Приозёрная'),
	('Деревня Кукуево'),
	('Гимназия №1');


--Вставка записей в таблицу Маршруты
INSERT INTO route("number", startStation, endStation, quantityStation, passengerFlow)
VALUES
	('1A', 1, 5, 10, 500),
	('15', 2, 6, 20, 1000),
	('2', 3, 4, 15, 200),
	('100', 7, 8, 10, 1250),
	('5', 9, 10, 5, 350),
	('2A', 1, 4, 12, 400),
	('11', 4, 10, 16, 420),
	('12', 9, 3, 15, 400),
	('105', 7, 4, 10, 800),
	('10', 8, 2, 20, 750);


--Вставка записей в таблицу Водители
INSERT INTO driver(surname, name, age)
VALUES
	('Иванов', 'Иван', 50),
	('Петров', 'Петр', 35),
	('Пупкин', 'Вася', 22),
	('Сидоров', 'Сидр', 65),
	('Новгородов-Великий', 'Козьма', 30),
	('Бабаягодков', 'Тимофей', 45);


--Вставка записей в таблицу Расписание
INSERT INTO schedule(routeDate, route_id, bus_id, driver_id)
VALUES
	('2024-12-15T10:00:00', 1, 6, 2),
	('2024-12-15T12:00:00', 2, 5, 1),
	('2024-12-15T16:30:00', 5, 1, 6),
	('2024-12-16T09:45:00', 4, 10, 2),
	('2024-12-16T15:15:00', 3, 8, 3),
	('2024-12-17T11:00:00', 6, 4, 1),
	('2024-12-18T10:00:00', 7, 9, 5),
	('2024-12-18T12:30:00', 1, 7, 4),
	('2024-12-18T14:30:00', 9, 2, 5),
	('2024-12-18T18:00:00', 4, 9, 2),
	('2024-12-19T15:50:00', 10, 3, 1),
	('2024-12-19T19:10:00', 8, 3, 4);
